Squashed commit of the following:
commit 2895e6bc0b8513c38b8b4e41de18ea0ca7df4659
Author: Ivan Volozhenin <ivan.volozhenin@ideportriga.com>
Date:   Fri Nov 28 10:17:46 2025 +0200

    remove

commit 26bb97f693852e68a4d8730ca31a28e660173de0
Author: Ivan Volozhenin <ivan.volozhenin@ideportriga.com>
Date:   Fri Nov 28 10:07:23 2025 +0200

    fix

commit 2875b25047fe4de0156b1229116911f28147f367
Author: Ivan Volozhenin <ivan.volozhenin@ideportriga.com>
Date:   Fri Nov 28 10:05:40 2025 +0200

    fix

commit a89d3e546df5d296ae30825be2bd3316dbe34900
Author: Ivan Volozhenin <ivan.volozhenin@ideportriga.com>
Date:   Fri Nov 28 10:02:07 2025 +0200

    fix documentation

commit 11c7d928f2186d5e90497120db47c9d710fb2b21
Author: Ivan Volozhenin <ivan.volozhenin@ideportriga.com>
Date:   Fri Nov 28 06:59:00 2025 +0200

    remove

commit 128ded0c9e5ef7f65b915be00cc9879e2740ba80
Author: Ivan Volozhenin <ivan.volozhenin@ideportriga.com>
Date:   Thu Nov 27 22:36:36 2025 +0200

    add scripts

commit 0b19287feb0c159ddae3ca979e3a747f2a395de4
Author: Ivan Volozhenin <ivan.volozhenin@ideportriga.com>
Date:   Thu Nov 27 17:21:15 2025 +0200

    fix

commit f994b0f18f64c0f74a4905118b605048d094fbc1
Author: Ivan Volozhenin <ivan.volozhenin@ideportriga.com>
Date:   Thu Nov 27 17:05:20 2025 +0200

    fixes

commit b9760d89c909f2b2ecbd61175d5b039383d31f14
Author: Ivan Volozhenin <ivan.volozhenin@ideportriga.com>
Date:   Thu Nov 27 10:33:08 2025 +0200

    fixes

commit 2bef335329e19fd5e144915030e0332225e67a60
Author: Ivan Volozhenin <ivan.volozhenin@ideportriga.com>
Date:   Thu Nov 27 10:31:05 2025 +0200

    docs

commit 98e0e029fa8f77ea0bad5848bb69cbedb475efde
Author: Ivan Volozhenin <ivan.volozhenin@ideportriga.com>
Date:   Thu Nov 27 10:29:46 2025 +0200

    fix git ignore

commit 3ab54c826ffc1f0583b646d80278db773573f817
Author: Ivan Volozhenin <ivan.volozhenin@ideportriga.com>
Date:   Thu Nov 27 10:28:57 2025 +0200

    spec kit
